# DivisionSketchCurveDivisionParamsOverrideParam Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..DivisionSketchCurveDivisionParamsOverrideParam Property
ParameterTypeId Class See Also
---
"Profile Override"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId DivisionSketchCurveDivisionParamsOverrideParam { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property DivisionSketchCurveDivisionParamsOverrideParam As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ DivisionSketchCurveDivisionParamsOverrideParam {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace